--
-- Скрипт сгенерирован Devart dbForge Studio for MySQL, Версия 7.2.78.0
-- Домашняя страница продукта: http://www.devart.com/ru/dbforge/mysql/studio
-- Дата скрипта: 05.ноя.2017 02:55:47
-- Версия сервера: 5.7.16-log
-- Версия клиента: 4.1
--


-- 
-- Отключение внешних ключей
-- 
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;

-- 
-- Установить режим SQL (SQL mode)
-- 
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 
-- Установка кодировки, с использованием которой клиент будет посылать запросы на сервер
--
SET NAMES 'utf8';

-- 
-- Установка базы данных по умолчанию
--
USE django_xphorism;

--
-- Описание для таблицы app_tbcontacts
--
DROP TABLE IF EXISTS app_tbcontacts;
CREATE TABLE app_tbcontacts (
  id INT(11) NOT NULL AUTO_INCREMENT,
  szPersonBigName VARCHAR(100) NOT NULL,
  szParsonAdress VARCHAR(140) NOT NULL,
  PRIMARY KEY (id),
  UNIQUE INDEX szPersonBigName (szPersonBigName)
)
ENGINE = INNODB
AUTO_INCREMENT = 28
AVG_ROW_LENGTH = 630
CHARACTER SET utf8
COLLATE utf8_general_ci
ROW_FORMAT = DYNAMIC;

--
-- Описание для таблицы app_tbtelephones
--
DROP TABLE IF EXISTS app_tbtelephones;
CREATE TABLE app_tbtelephones (
  id INT(11) NOT NULL AUTO_INCREMENT,
  szTelephoneNumber VARCHAR(20) NOT NULL,
  kContacts_id INT(11) DEFAULT NULL,
  PRIMARY KEY (id),
  INDEX app_tbtelephones_kContacts_id_8a9d6b3b (kContacts_id)
)
ENGINE = INNODB
AUTO_INCREMENT = 51
AVG_ROW_LENGTH = 327
CHARACTER SET utf8
COLLATE utf8_general_ci
ROW_FORMAT = DYNAMIC;

-- 
-- Вывод данных для таблицы app_tbcontacts
--
INSERT INTO app_tbcontacts VALUES
(1, 'Лев Толстой‎', '—'),
(2, 'Алексей Толстой‎', '—'),
(3, 'Николай Васильевич Гоголь', '—'),
(4, 'Маркиз де Сад', '—'),
(5, 'Фёдор Достоевский', '—'),
(6, 'Эдгар Аллан По‎', '—'),
(7, 'Айзек Азимов‎', 'США'),
(8, 'Жюль Верн‎', 'Франция'),
(9, 'Ярослав Гашек', 'Австро-Венгерская Империя'),
(11, 'Иван Ефремов‎', 'СССР'),
(12, 'Чарльз Диккенс‎', '--'),
(13, 'Сергей Есенин‎', '--'),
(14, 'Мигель де Сервантес', '--'),
(15, 'Владимир Набоков‎', '--'),
(16, 'Кот Матроскин', 'СССР, д. Простоквашино'),
(17, 'Фридрих Ницше‎', 'Германская империя,  Веймар,'),
(18, 'Аристотель', 'Древняя Греция'),
(19, 'Платон‎', 'Древняя Греция'),
(20, 'Сократ‎', 'Древняя Греция'),
(21, 'Харуки Мураками', 'Япония'),
(22, 'Мацуо Басё', 'Япония'),
(23, 'Гомер Симпсон', 'США, Спрингфилд'),
(24, 'Бендер <small>(робот)</small>', 'Земля, Верхний Нью-Йорк'),
(25, 'Фрай Фарнсворт', 'Земля, Верхний Нью-Йорк'),
(26, 'Хьюберт Фарнсворт', 'Земля, Верхний Нью-Йорк'),
(27, 'Александр Сергеевич Грибоедов‎', 'Российская империя');

-- 
-- Вывод данных для таблицы app_tbtelephones
--
INSERT INTO app_tbtelephones VALUES
(1, '+2(707)538-77-44', 7),
(2, '+6(621)385-99-93', 2),
(3, '+3(060)698-73-70', 15),
(4, '+9(523)458-64-14', 15),
(5, '+6(560)382-55-29', 15),
(6, '+2(291)117-18-89', 15),
(7, '+3(903)304-98-38', 23),
(8, '+5(545)583-00-62', 23),
(9, '+2(465)336-45-33', 8),
(10, '+8(169)474-25-15', 8),
(11, '+2(858)976-85-13', 8),
(12, '+4(287)350-24-61', 8),
(13, '+9(022)650-95-61', 11),
(14, '+5(544)403-06-99', 11),
(15, '+2(128)366-15-26', 11),
(16, '+8(196)415-61-53', 16),
(17, '+7(450)796-93-45', 16),
(18, '+9(578)396-20-03', 1),
(19, '+8(789)947-52-78', 1),
(20, '+1(231)823-02-06', 4),
(21, '+7(453)690-90-61', 4),
(22, '+4(310)755-44-62', 22),
(23, '+8(830)526-89-52', 14),
(24, '+1(394)626-69-42', 14),
(25, '+4(840)671-39-16', 14),
(26, '+9(045)161-98-18', 14),
(27, '+9(545)508-98-87', 3),
(28, '+9(357)941-95-16', 3),
(29, '+3(501)512-12-32', 19),
(30, '+9(243)987-58-95', 19),
(31, '+2(831)531-78-90', 19),
(32, '+2(157)485-20-58', 19),
(33, '+6(341)210-78-93', 20),
(34, '+3(270)977-41-48', 5),
(35, '+3(374)125-17-04', 5),
(36, '+2(821)373-36-07', 5),
(37, '+9(103)141-76-60', 17),
(38, '+4(388)856-51-13', 17),
(39, '+1(513)204-52-15', 21),
(40, '+6(877)923-35-97', 21),
(41, '+8(623)466-74-24', 21),
(42, '+7(047)714-63-46', 12),
(43, '+6(885)653-58-97', 12),
(44, '+9(355)185-31-57', 12),
(45, '+2(947)343-47-65', 6),
(46, '+6(744)125-37-39', 6),
(47, '+3(271)464-48-89', 9),
(48, '+6(490)988-59-07', 9),
(49, '+8(727)379-62-53', 9),
(50, '+6(570)172-98-88', 9);

-- 
-- Восстановить предыдущий режим SQL (SQL mode)
-- 
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;

-- 
-- Включение внешних ключей
-- 
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;